content/posts/mail.md
+++
title = "Mail"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:04:37-07:00
slug = "mail"
draft = false
+++

Checking and interacting with mail.


## UI {#ui}

<https://github.com/icyphox/mael> mail client in bash and python


## Etc {#etc}

<https://dbp.io/essays/2013-06-29-hackers-replacement-for-gmail.html>
<https://www.reddit.com/r/selfhosted/comments/ha1ikl/best%5Fvps%5Ffor%5Femail%5Fserver/>
<https://dbp.io/essays/2018-01-01-home-backups.html> backing up is important!

email ideas:

-   generate arb. email name with the same domain per website, using email
    similar to web name
-   fwd these emails to central repo
-   know exactly what service these emails came from
-   quick frontend to generate these email addresses/inboxes for subscriptions
